export default function () {

const goodFaces = ['👩🏻','👨🏻','🧑🏻','👧🏻','🧒🏻','👦🏻','👨🏻‍🦰','👩🏻‍🦰','🧓🏻','👴🏻','👵🏻','👶🏻','🧑🏻‍🦰','👩🏻‍🦱','👨🏻‍🦱','🧑🏻‍🦱','👩🏻‍🦲','👨🏻‍🦲','👱🏻‍♂️','👱🏻‍♀️','🧑🏻‍🦳','👨🏻‍🦳','👩🏻‍🦳','🧑🏻‍🦲','👱🏻','👳🏻‍♀️','👳🏻‍♂️','👳🏻','🧔🏻‍♀️','🧔🏻‍♂️','🧔🏻','👩🏼','👨🏼','🧑🏼','👧🏼','👦🏼','🧒🏼','👶🏼','👵🏼','👴🏼','🧓🏼','👩🏼‍🦰','👨🏼‍🦰','🧑🏼‍🦰','👩🏼‍🦱','👨🏼‍🦱','🧑🏼‍🦱','👩🏼‍🦲','👨🏼‍🦲','🧑🏼‍🦲','👩🏼‍🦳','👨🏼‍🦳','🧑🏼‍🦳','👱🏼‍♀️','👱🏼‍♂️','👱🏼','👳🏼‍♀️','👳🏼‍♂️','👳🏼','🧔🏼','🧔🏼‍♂️','🧔🏼‍♀️','👩🏽','👨🏽','🧑🏽','👧🏽','👦🏽','🧒🏽','👶🏽','👵🏽','👴🏽','🧓🏽','👩🏽‍🦰','👨🏽‍🦰','🧑🏽‍🦰','👩🏽‍🦱','👨🏽‍🦱','🧑🏽‍🦱','👩🏽‍🦲','👨🏽‍🦲','🧑🏽‍🦲','👩🏽‍🦳','👨🏽‍🦳','🧑🏽‍🦳','👱🏽‍♀️','👱🏽‍♂️','👱🏽','👳🏽‍♀️','👳🏽‍♂️','👳🏽','🧔🏽','🧔🏽‍♂️','🧔🏽‍♀️','👩🏾','👨🏾','🧑🏾','👧🏾','👦🏾','🧒🏾','👶🏾','👵🏾','👴🏾','🧓🏾','👩🏾‍🦰','👨🏾‍🦰','🧑🏾‍🦰','👩🏾‍🦱','👨🏾‍🦱','🧑🏾‍🦱','👩🏾‍🦲','👨🏾‍🦲','🧑🏾‍🦲','👩🏾‍🦳','👨🏾‍🦳','🧑🏾‍🦳','👱🏾‍♀️','👱🏾','👱🏾‍♂️','👱🏾','👳🏾‍♀️','👳🏾‍♂️','👳🏾','🧔🏾','🧔🏾‍♂️','🧔🏾‍♀️','👩🏿','👨🏿','🧑🏿','👧🏿','👦🏿','🧒🏿','👶🏿','👵🏿','👴🏿','🧓🏿','👩🏿‍🦰','👨🏿‍🦰','🧑🏿‍🦰','👩🏿‍🦱','👨🏿‍🦱','🧑🏿‍🦱','👩🏿‍🦲','👨🏿‍🦲','🧑🏿‍🦲','👩🏿‍🦳','🧑🏿‍🦳','👨🏿‍🦳','👱🏿‍♀️','👱🏿‍♂️','👱🏿','👳🏿‍♀️','👳🏿‍♂️','👳🏿','🧔🏿','🧔🏿‍♂️','🧔🏿‍♀️']
const evilFaces = ['👺','👹','👿','😈','💀','👽']

Layers.create(() => {
  new Layer({
    id: 'self',
    renderer: WEBGL,
    noLoop: true,

    menu: {
      isEvil: {
        max: 1,
        step: 1,
      },
      face: {
        type: 'slider',
        options: goodFaces
      },
      rotX: {
        step: 0.01,
        min: TWO_PI/10,
        max: TWO_PI/6,
      },
      rotY: {
        step: 0.01,
        min: 0,
        max: TWO_PI/8,
      },
      rotZ: {
        step: 0.01,
        min: -PI/3,
        max: 0,
      }
    },
    store: {},

    setup () {
      canvas.setAttributes('alpha', true)
      offscreen.textAlign(CENTER, CENTER)
    },

    draw () {
      // Draw face above water
      offscreen.clear()
      offscreen.textSize(minSize*.5)
      offscreen.translate(width/2, height/2)
      offscreen.rotate(-PI/3)
      offscreen.text($face, 0, 0)

      clear()
      texture(offscreen)
      noStroke()

      push()
      translate(0, -minSize*.25, -minSize*.5)
      rotateX(-$rotX)
      rotateY(-$rotY)
      plane(width, height)
      pop()

      // Draw face below water
    }
  })
})
}