export default function () {
const heads = ['👩🏻','👨🏻','🧑🏻','👧🏻','🧒🏻','👦🏻','👨🏻‍🦰','👩🏻‍🦰','🧓🏻','👴🏻','👵🏻','👶🏻','🧑🏻‍🦰','👩🏻‍🦱','👨🏻‍🦱','🧑🏻‍🦱','👩🏻‍🦲','👨🏻‍🦲','👱🏻‍♂️','👱🏻‍♀️','🧑🏻‍🦳','👨🏻‍🦳','👩🏻‍🦳','🧑🏻‍🦲','👱🏻','👳🏻‍♀️','👳🏻‍♂️','👳🏻','🧔🏻‍♀️','🧔🏻‍♂️','🧔🏻','👩🏼','👨🏼','🧑🏼','👧🏼','👦🏼','🧒🏼','👶🏼','👵🏼','👴🏼','🧓🏼','👩🏼‍🦰','👨🏼‍🦰','🧑🏼‍🦰','👩🏼‍🦱','👨🏼‍🦱','🧑🏼‍🦱','👩🏼‍🦲','👨🏼‍🦲','🧑🏼‍🦲','👩🏼‍🦳','👨🏼‍🦳','🧑🏼‍🦳','👱🏼‍♀️','👱🏼‍♂️','👱🏼','👳🏼‍♀️','👳🏼‍♂️','👳🏼','🧔🏼','🧔🏼‍♂️','🧔🏼‍♀️','👩🏽','👨🏽','🧑🏽','👧🏽','👦🏽','🧒🏽','👶🏽','👵🏽','👴🏽','🧓🏽','👩🏽‍🦰','👨🏽‍🦰','🧑🏽‍🦰','👩🏽‍🦱','👨🏽‍🦱','🧑🏽‍🦱','👩🏽‍🦲','👨🏽‍🦲','🧑🏽‍🦲','👩🏽‍🦳','👨🏽‍🦳','🧑🏽‍🦳','👱🏽‍♀️','👱🏽‍♂️','👱🏽','👳🏽‍♀️','👳🏽‍♂️','👳🏽','🧔🏽','🧔🏽‍♂️','🧔🏽‍♀️','👩🏾','👨🏾','🧑🏾','👧🏾','👦🏾','🧒🏾','👶🏾','👵🏾','👴🏾','🧓🏾','👩🏾‍🦰','👨🏾‍🦰','🧑🏾‍🦰','👩🏾‍🦱','👨🏾‍🦱','🧑🏾‍🦱','👩🏾‍🦲','👨🏾‍🦲','🧑🏾‍🦲','👩🏾‍🦳','👨🏾‍🦳','🧑🏾‍🦳','👱🏾‍♀️','👱🏾','👱🏾‍♂️','👱🏾','👳🏾‍♀️','👳🏾‍♂️','👳🏾','🧔🏾','🧔🏾‍♂️','🧔🏾‍♀️','👩🏿','👨🏿','🧑🏿','👧🏿','👦🏿','🧒🏿','👶🏿','👵🏿','👴🏿','🧓🏿','👩🏿‍🦰','👨🏿‍🦰','🧑🏿‍🦰','👩🏿‍🦱','👨🏿‍🦱','🧑🏿‍🦱','👩🏿‍🦲','👨🏿‍🦲','🧑🏿‍🦲','👩🏿‍🦳','🧑🏿‍🦳','👨🏿‍🦳','👱🏿‍♀️','👱🏿‍♂️','👱🏿','👳🏿‍♀️','👳🏿‍♂️','👳🏿','🧔🏿','🧔🏿‍♂️','🧔🏿‍♀️','👽', '🐵', '😺', '🦁', '🐯', '🐺', '🐶', '🦊', '🦝', '🐮', '🐷', '🐭', '🐼', '🐨', '🐻‍❄️', '🐻', '🐰', '🐹', '🐸', ]
const tops = ['🦺', '🥼', '🧥', '👕', '👚', '🎽']
const bottoms = ['👖','🩳']
const shoes = ['👞','🥾','🥿','👠','👡','👢','⛸️']


Layers.create(() => {
  new Layer({
    id: 'bg',
    noLoop: true,

    colors: [
      // Limestone base
      '#eee2c7',
      // Dark Green
      '#003333'
    ],

    menu: {},
    store: {
      subjects: []
    },

    setup () {
      $subjects = []
      let numSubjects = ~~random(1, 5)

      for (let i = 0; i < numSubjects; i++) {
        $subjects.push({
          head: random(heads),
          top: random(tops),
          bottom: random(bottoms),
          shoes: random(shoes)
        })
      }

      textAlign(CENTER, CENTER)
    },

    draw () {
      push()
      translate(minSize*.25, minSize*.3)
      $subjects.forEach(subject => {
        // Draw subject
        textSize(minSize*.15)
        text(subject.shoes, -minSize*.025, minSize*.5)
        text(subject.shoes, minSize*.075, minSize*.5)
        
        textSize(minSize*.2)
        text(subject.bottom, 0, minSize*.35)
        text(subject.top, 0, minSize*.15)
        text(subject.head, 0, 0)

        // Shift over for next subject
        translate(minSize*.3, 0)
      })
      pop()
    }
  })
})
}